//au//IntroCutscene
#pragma once
#include <ark/class.hpp>
#include <au/UnityEngine/MonoBehaviour.hpp>
struct TextRenderer;
struct PoolablePlayer;
namespace UnityEngine{ struct MeshRenderer; }
struct FloatRange;
namespace UnityEngine{ struct SpriteRenderer; }
namespace UnityEngine{ struct AudioClip; }
struct DualshockLightManager_DBFBCOPOCHH;
namespace System::Collections{ struct IEnumerator; }
namespace System::Collections::Generic{ template <class> struct List; }
struct PlayerControl;
struct IntroCutscene : ark::meta<IntroCutscene, UnityEngine::MonoBehaviour>
{
ark_meta("", "IntroCutscene", "");

    // Fields

    static IntroCutscene* Instance(); // 0x0
    TextRenderer* Title; // 0xC
    TextRenderer* ImpostorText; // 0x10
    PoolablePlayer* PlayerPrefab; // 0x14
    UnityEngine::MeshRenderer* BackgroundBar; // 0x18
    UnityEngine::MeshRenderer* Foreground; // 0x1C
    FloatRange* ForegroundRadius; // 0x20
    UnityEngine::SpriteRenderer* FrontMost; // 0x24
    UnityEngine::AudioClip* IntroStinger; // 0x28
    float BaseY; // 0x2C
    DualshockLightManager_DBFBCOPOCHH* MJIPKDMJIHF; // 0x30

    // Methods

    System::Collections::IEnumerator* NCLNOJJCOIO(System::Collections::Generic::List<PlayerControl>* IIIDKFCDNJB, bool LHCDGDFPCBN); // 0x1CBE650 // public 
    System::Collections::IEnumerator* MIAJIFLFGHO(System::Collections::Generic::List<PlayerControl>* IIIDKFCDNJB, bool LHCDGDFPCBN); // 0x1CBCB60 // public 
    void KDAJBICCOLB(System::Collections::Generic::List<PlayerControl>* IIIDKFCDNJB); // 0x1CB7A70 // private 
    void AOBBNNIPLOG(System::Collections::Generic::List<PlayerControl>* IIIDKFCDNJB); // 0x1CAD000 // private 
    System::Collections::IEnumerator* OIDBIMODCPH(System::Collections::Generic::List<PlayerControl>* IIIDKFCDNJB, bool LHCDGDFPCBN); // 0x1CC0270 // public 
    System::Collections::IEnumerator* KFIPNKPGJIM(System::Collections::Generic::List<PlayerControl>* IIIDKFCDNJB, bool LHCDGDFPCBN); // 0x1CB80F0 // public 
