//au//ShipStatus
#pragma once
#include <ark/class.hpp>
#include <au/InnerNet/InnerNetObject.hpp>
#include <au/UnityEngine/Color.hpp>
struct MapBehaviour;
struct ExileController;
struct OverlayKillAnimation;
#include <au/UnityEngine/Vector2.hpp>
#include <cs/array.hpp>
namespace System::Collections::Generic{ template <class...> struct Dictionary; }
namespace UnityEngine{ struct AudioClip; }
namespace PowerTools{ struct SpriteAnim; }
namespace UnityEngine{ struct AnimationClip; }
namespace UnityEngine{ struct ParticleSystem; }
namespace UnityEngine{ struct SpriteRenderer; }
namespace UnityEngine{ struct Sprite; }
struct MedScannerBehaviour;
#include <au/ShipStatus_MapType.hpp>
#include <au/MapArea.hpp>
#include <au/PlayerTask.hpp>
#include <au/NormalPlayerTask.hpp>
struct PlayerControl;
struct GameData_PlayerInfo;
#include <au/EndGameReason.hpp>
#include <au/StringNames.hpp>
namespace Hazel{ struct MessageWriter; }
namespace Hazel{ struct MessageReader; }
struct NormalPlayerTask;
namespace System::Collections{ struct IEnumerator; }
namespace System::Collections::Generic{ template <class> struct List; }
namespace System::Collections::Generic{ template <class...> struct HashSet; }
struct Vent;

struct ShipStatus : ark::meta<ShipStatus, InnerNet::InnerNetObject>
{
ark_meta("", "ShipStatus", "");

    // Fields

    static ShipStatus* Instance(); // 0x0
    UnityEngine::Color CameraColor; // 0x24
    float MaxLightRadius; // 0x34
    float MinLightRadius; // 0x38
    float MapScale; // 0x3C
    MapBehaviour* MapPrefab; // 0x40
    ExileController* ExileCutscenePrefab; // 0x44
    OverlayKillAnimation* EmergencyOverlay; // 0x48
    OverlayKillAnimation* ReportOverlay; // 0x4C
    UnityEngine::Vector2 InitialSpawnCenter; // 0x50
    UnityEngine::Vector2 MeetingSpawnCenter; // 0x58
    UnityEngine::Vector2 MeetingSpawnCenter2; // 0x60
    float SpawnRadius; // 0x68
    cs::array<NormalPlayerTask>* CommonTasks; // 0x6C
    cs::array<NormalPlayerTask>* LongTasks; // 0x70
    cs::array<NormalPlayerTask>* NormalTasks; // 0x74
    cs::array<PlayerTask>* SpecialTasks; // 0x78
    cs::array<UnityEngine::Transform>* DummyLocations; // 0x7C
    cs::array<struct SurvCamera*>* AllCameras; // 0x80
    cs::array<struct PlainDoor*>* AllDoors; // 0x84
    cs::array<struct Console*>* Alls; // 0x88
    System::Collections::Generic::Dictionary<MapArea, struct CBFMKGACLNE*>* Systems; // 0x8C
    cs::array<StringNames>* SystemNames; // 0x90
    cs::array<TaskType>* _EENFBHNGDPI_k__BackingField; // 0x94
    cs::array<struct PlainShipRoom*>* _AADJNODEAEO_k__BackingField; // 0x98
    System::Collections::Generic::Dictionary<MapArea, struct PlainShipRoom*>* _MHLFLFAJHDL_k__BackingField; // 0x9C
    cs::array<Vent>* _ICFPNAEHMIA_k__BackingField; // 0xA0
    UnityEngine::AudioClip* SabotageSound; // 0xA4
    cs::array<UnityEngine::AnimationClip>* WeaponFires; // 0xA8
    PowerTools::SpriteAnim* WeaponsImage; // 0xAC
    cs::array<UnityEngine::AudioClip>* VentMoveSounds; // 0xB0
    UnityEngine::AudioClip* VentEnterSound; // 0xB4
    UnityEngine::AnimationClip* HatchActive; // 0xB8
    PowerTools::SpriteAnim* Hatch; // 0xBC
    UnityEngine::ParticleSystem* HatchParticles; // 0xC0
    UnityEngine::AnimationClip* ShieldsActive; // 0xC4
    cs::array<PowerTools::SpriteAnim>* ShieldsImages; // 0xC8
    UnityEngine::SpriteRenderer* ShieldBorder; // 0xCC
    UnityEngine::Sprite* ShieldBorderOn; // 0xD0
    MedScannerBehaviour* MedScanner; // 0xD4
    int PHBMACMGIPG; // 0xD8
    float Timer; // 0xDC
    float EmergencyCooldown; // 0xE0
    ShipStatus_MapType Type; // 0xE4
    bool _JHDLPBFKOIL_k__BackingField; // 0xE8
    int KPFIAIGDLPK; // 0xEC

    // Methods

    void GKNFAFOBAIN(cs::array<struct PlainShipRoom*>* IKGGJMHPDGH); // 0x8FAE40 // private
    void PMFCDEGOKIM(System::Collections::Generic::Dictionary<MapArea, struct PlainShipRoom*>* IKGGJMHPDGH); // 0x5D8EF0 // private
    void OPEMGPNLIGG(MapArea OJOBEIGMNMD, PlayerControl* CJFDNCENCEM, uint8_t HGIEDPKOHNJ); // 0x1A4E550 // public
    void DPJPLJHEDFG(MapArea CDLMBAHPJJJ); // 0x1A45690 // public
    void GGKNONHPJAB(); // 0x1A47E90 // private static 
    void OCCGENFHIFO(cs::array<TaskType>* IKGGJMHPDGH); // 0x3C2C40 // private
    void BLMLGNHDFOM(cs::array<Vent>* IKGGJMHPDGH); // 0x3C2D60 // private
    void PMFBOJMKPIJ(bool IKGGJMHPDGH); // 0x1A44730 // public 
    void OKDFOFMOAOP(); // 0x1A4E1C0 // private 
    void KDAGMMDJPGH(); // 0x1A4A590 // public virtual 
    void PPACDINHKMF(); // 0x1A4F260 // private 
