#pragma once

#include <ark/class.hpp>
#include <autogen/InnerNet/InnerNetObject.hpp>
#include <autogen/System/Collections/Generic/List.hpp>
#include <autogen/UnityEngine/TextRenderer.hpp>
#include <autogen/UnityEngine/Vector2.hpp>

template<class T> using List = System::Collections::Generic::List<T>;
using Vector2 = UnityEngine::Vector2;
using TextRenderer = UnityEngine::TextRenderer;

struct PlayerControl : InnerNet::InnerNetObject, ark::meta<PlayerControl> // TypeDefIndex: 8921
{
	static inline auto internal_name = "FFGALNAPKCD";
	std::int32_t MKMDLEOKDIN; // 0x24
	std::int8_t PlayerId; // 0x28
	float MaxReportDistance; // 0x2C
	bool moveable; // 0x30
	bool inVent; // 0x31
	PlayerControl* LocalPlayer; // 0x0
	struct EGLJNOMOGNP_DCJMABDDJCF* NDGFFHMFGIG; // 0x34
	struct AudioSource* FootSteps; // 0x38
	struct AudioClip* KillSfx; // 0x3C
	struct MNGKAKKOKPN* KillAnimations; // 0x40

	float killTimer; // 0x44
	std::int32_t RemainingEmergencies; // 0x48
	TextRenderer* nameText; // 0x4C
	struct APONPILBEGP* LightPrefab; // 0x50
	struct APONPILBEGP* BFEGOAGLOGD; // 0x54

	struct Collider2D* Collider; // 0x58

	struct LIMNONMAAFA* MyPhysics; // 0x5C

	struct LNBAPKHKDPG* NetTransform; // 0x60
	struct DLMDFGBMGPC* CurrentPet; // 0x64
	struct DAMECBEEJAL* HatRenderer; // 0x68
	struct SpriteRenderer* MKIDFJAEBGH; // 0x6C
	struct Collider2D* FGIKJBLDEIL; // 0x70
	struct KMOGFLPJLLK* GameOptions; // 0x4
	List<struct PILBGHDHJLH>* myTasks; // 0x74
	struct SpriteAnim* ScannerAnims; // 0x78
	struct SpriteRenderer* ScannersImages; // 0x7C
	struct CMCLOPELAIG* PJHNJMEGPFG; // 0x80
	bool OJIGFMDLDAK; // 0x84
	List<PlayerControl>* AllPlayerControls; // 0x8
	/*struct Dictionary<Collider2D, CMCLOPELAIG>* */ void* PMJANCAEKGA; // 0x88
	List<CMCLOPELAIG>* GMCMFOMNLMN; // 0x8C
	List<CMCLOPELAIG>* LOJJDGNBIIN; // 0x90
	std::int8_t OMMKFLAIKKJ; // 0x94
	bool LAGLLALNLPJ; // 0x95

	void RpcSetScanner(bool HIJOHCLAKMG) { return method_call(RpcSetScanner, HIJOHCLAKMG); } // 0x8F06B0
	//void SetPetImage(std::uint32_t FHPHKIBKMHO, std::int32_t NPFHOONFFDI, struct SpriteRenderer* CAKODNGLPDF) { return method_call(SetPetImage, FHPHKIBKMHO, NPFHOONFFDI, CAKODNGLPDF); } // 0x8F0FC0
	void ILICKLHOAEF(std::uint32_t AOONHAJNJLD) { return method_call(ILICKLHOAEF, AOONHAJNJLD); } // 0x8E7EA0
	void HNEOMMPDEKA(struct EGLJNOMOGNP_DCJMABDDJCF* CAKODNGLPDF) { return method_call(HNEOMMPDEKA, CAKODNGLPDF); } // 0x8E7620
	void NOABIGDJKAG(struct PILBGHDHJLH* OJGILIGMHKL) { return method_call(NOABIGDJKAG, OJGILIGMHKL); } // 0x8ED160
	void JCLKGBPJOJB(std::int8_t POCIJABNOLE) { return method_call(JCLKGBPJOJB, POCIJABNOLE); } // 0x8E8470
	void IOKMGLKDMIB(std::int8_t BOFNMFDDECJ) { return method_call(IOKMGLKDMIB, BOFNMFDDECJ); } // 0x8E83E0
	void KLMOINNFPAD() { return method_call(KLMOINNFPAD, ); } // 0x8E9E60
